  {
    "name":"Human",
    "content":" Human Traits\n\nIt’s hard to make generalizations about humans, but your human character has these traits.\n\n**Ability Score Increase**: Your ability scores each increase by 1.\n\n**Age**: Humans reach adulthood in their late teens and live less than a century.\n\n**Alignment**: Humans tend toward no particular alignment. The best and the worst are found among them.\n\n**Size**: Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.\n\n**Speed**: Your base walking speed is 30 feet.\n\n**Languages**: You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on.",
    "htmlcontent":"<a></a><h2>Human Traits</h2>It’s hard to make generalizations about humans, but your human character has these traits.<br><br><strong>Ability Score Increase</strong>: Your ability scores each increase by 1.<br><br><strong>Age</strong>: Humans reach adulthood in their late teens and live less than a century.<br><br><strong>Alignment</strong>: Humans tend toward no particular alignment. The best and the worst are found among them.<br><br><strong>Size</strong>: Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.<br><br><strong>Speed</strong>: Your base walking speed is 30 feet.<br><br><strong>Languages</strong>: You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on.",
    "data":{"Category":"Races"}
  }
