{"name":"Half-Orc","id":5191,"content":" Half-Orc Traits\n\nYour half-orc character has certain traits deriving from your orc ancestry.\n\n**Ability Score Increase**: Your Strength score increases by 2, and your Constitution score increases by 1.\n\n**Age**: Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n\n**Alignment**: Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.\n\n**Size**: Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.\n\n**Speed**: Your base walking speed is 30 feet.\n\n**Darkvision**: Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.\n\n**Menacing**: You gain proficiency in the Intimidation skill.\n\n**Relentless Endurance**: When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest.\n\n**Savage Attacks**: When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit.\n\n**Languages**: You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script.\n ","htmlcontent":"<a></a><h2>Half-Orc Traits</h2>Your half-orc character has certain traits deriving from your orc ancestry.<br><br><strong>Ability Score Increase</strong>: Your Strength score increases by 2, and your Constitution score increases by 1.<br><br><strong>Age</strong>: Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.<br><br><strong>Alignment</strong>: Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.<br><br><strong>Size</strong>: Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.<br><br><strong>Speed</strong>: Your base walking speed is 30 feet.<br><br><strong>Darkvision</strong>: Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.<br><br><strong>Menacing</strong>: You gain proficiency in the Intimidation skill.<br><br><strong>Relentless Endurance</strong>: When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest.<br><br><strong>Savage Attacks</strong>: When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit.<br><br><strong>Languages</strong>: You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script.<br>","data":{"Category":"Races"}}