{"name":"Dragonborn","id":5188,"content":" Dragonborn Traits\n\nYour draconic heritage manifests in a variety of traits you share with other dragonborn.\n\n**Ability Score Increase**: Your Strength score increases by 2, and your Charisma score increases by 1.\n\n**Age**: Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.\n\n**Alignment**: Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil. Most dragonborn are good, but those who side with evil can be terrible villains.\n\n**Size**: Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.\n\n**Speed**: Your base walking speed is 30 feet.\n\n Draconic AncestryDragonDamage TypeBreath WeaponBlackAcid5 by 30 ft. line (Dex. save)BlueLightning5 by 30 ft. line (Dex. save)BrassFire5 by 30 ft. line (Dex. save)BronzeLightning5 by 30 ft. line (Dex. save)CopperAcid5 by 30 ft. line (Dex. save)GoldFire15 ft. cone (Dex. save)GreenPoison15 ft. cone (Con. save)RedFire15 ft. cone (Dex. save)SilverCold15 ft. cone (Con. save)WhiteCold15 ft. cone (Con. save)**Draconic Ancestry**: You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.\n\n**Breath Weapon**: You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.\n\nWhen you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.\n\nAfter you use your breath weapon, you can’t use it again until you complete a short or long rest.\n\n**Damage Resistance**: You have resistance to the damage type associated with your draconic ancestry.\n\n**Languages**: You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants.\n","htmlcontent":"<h2>Dragonborn Traits</h2>Your draconic heritage manifests in a variety of traits you share with other dragonborn.<br><br><strong>Ability Score Increase</strong>: Your Strength score increases by 2, and your Charisma score increases by 1.<br><br><strong>Age</strong>: Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.<br><br><strong>Alignment</strong>: Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil. Most dragonborn are good, but those who side with evil can be terrible villains.<br><br><strong>Size</strong>: Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.<br><br><strong>Speed</strong>: Your base walking speed is 30 feet.<br><br><table>\n<caption>Draconic Ancestry</caption>\n<thead><tr>\n<th>Dragon</th>\n<th>Damage Type</th>\n<th>Breath Weapon</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>Black</td>\n<td>Acid</td>\n<td>5 by 30 ft. line (Dex. save)</td>\n</tr>\n<tr>\n<td>Blue</td>\n<td>Lightning</td>\n<td>5 by 30 ft. line (Dex. save)</td>\n</tr>\n<tr>\n<td>Brass</td>\n<td>Fire</td>\n<td>5 by 30 ft. line (Dex. save)</td>\n</tr>\n<tr>\n<td>Bronze</td>\n<td>Lightning</td>\n<td>5 by 30 ft. line (Dex. save)</td>\n</tr>\n<tr>\n<td>Copper</td>\n<td>Acid</td>\n<td>5 by 30 ft. line (Dex. save)</td>\n</tr>\n<tr>\n<td>Gold</td>\n<td>Fire</td>\n<td>15 ft. cone (Dex. save)</td>\n</tr>\n<tr>\n<td>Green</td>\n<td>Poison</td>\n<td>15 ft. cone (Con. save)</td>\n</tr>\n<tr>\n<td>Red</td>\n<td>Fire</td>\n<td>15 ft. cone (Dex. save)</td>\n</tr>\n<tr>\n<td>Silver</td>\n<td>Cold</td>\n<td>15 ft. cone (Con. save)</td>\n</tr>\n<tr>\n<td>White</td>\n<td>Cold</td>\n<td>15 ft. cone (Con. save)</td>\n</tr>\n</tbody>\n</table><strong>Draconic Ancestry</strong>: You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.<br><br><strong>Breath Weapon</strong>: You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.<br><br>When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.<br><br>After you use your breath weapon, you can’t use it again until you complete a short or long rest.<br><br><strong>Damage Resistance</strong>: You have resistance to the damage type associated with your draconic ancestry.<br><br><strong>Languages</strong>: You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants.<br>","data":{"Source":"SRD 5.0","Category":"Races"}}