{"name":"Gnome","id":5189,"content":" Gnome Traits\n\nYour gnome character has certain characteristics in common with all other gnomes.\n\n**Ability Score Increase**: Your Intelligence score increases by 2.\n\n**Age**: Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.\n\n**Alignment**: Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious.\n\n**Size**: Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.\n\n**Speed**: Your base walking speed is 25 feet.\n\n**Darkvision**: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.\n\n**Gnome Cunning**: You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.\n\n**Languages**: You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world.\n\n Subraces\n\n Rock Gnome\n\nAs a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.\n\n**Ability Score Increase**: Your Constitution score increases by 1.\n\n**Artificer’s Lore**: Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.\n\n**Tinker**: You have proficiency with artisan’s tools (tinker’s tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time. When you create a device, choose one of the following options:\n \n**Clockwork Toy**: This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.\n\n**Fire Starter**: The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n\n**Music Box**: When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song’s end or when it is closed.    ","htmlcontent":"<h2>Gnome Traits</h2>Your gnome character has certain characteristics in common with all other gnomes.<br><br><strong>Ability Score Increase</strong>: Your Intelligence score increases by 2.<br><br><strong>Age</strong>: Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.<br><br><strong>Alignment</strong>: Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious.<br><br><strong>Size</strong>: Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.<br><br><strong>Speed</strong>: Your base walking speed is 25 feet.<br><br><strong>Darkvision</strong>: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.<br><br><strong>Gnome Cunning</strong>: You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.<br><br><strong>Languages</strong>: You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world.<br><br><h2>Subraces</h2><h3>Rock Gnome</h3>As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.<br><br><strong>Ability Score Increase</strong>: Your Constitution score increases by 1.<br><br><strong>Artificer’s Lore</strong>: Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.<br><br><strong>Tinker</strong>: You have proficiency with artisan’s tools (tinker’s tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time. When you create a device, choose one of the following options:<br><div style=\"margin-left: 20px;\">\n<br><strong>Clockwork Toy</strong>: This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.<br><br><strong>Fire Starter</strong>: The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.<br><br><strong>Music Box</strong>: When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song’s end or when it is closed.</div>","data":{"Category":"Races"}}