{"name":"Warlock","id":5209,"content":" **Warlock Spells by Name\n****Warlock Spells by Level** \nAs a warlock, you gain the following class features.\n\n Hit Points\n\n**Hit Dice**: 1d8 per warlock level\n**Hit Points at 1st Level**: 8 + your Constitution modifier\n**Hit Points at Higher Levels**: 1d8 (or 5) + your Constitution modifier per warlock level after 1st\n\n Starting Proficiencies\n\nYou are proficient with the following items, in addition to any proficiencies provided by your race or background.\n\n**Armor:** light armor\n**Weapons:** simple weapons\n**Tools:** none\n**Skills:** Choose two skills from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion\n\n Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n• (a) a light crossbow and 20 bolts or (b) any simple weapon\n• (a) a component pouch or (b) an arcane focus\n• (a) a scholar's pack or (b) a dungeoneer's pack\n• Leather Armor, any simple weapon, and two daggers\n\nAlternatively, you may start with 4d4 x 10 gp to buy your own equipment.\n\n   Table: The Warlock\nLevel\nProficiency Bonus\nFeatures\nCantrips Known\nSpells Known\nSpell Slots\nSlot Level\nInvocations\n\nKnown\n1st\n+2\nOtherworldly Patron, Pact Magic\n2\n2\n1\n1st\n-\n2nd\n+2\nEldritch Invocations\n2\n3\n2\n1st\n2\n3rd\n+2\nPact Boon\n2\n4\n2\n2nd\n2\n4th\n+2\nAbility Score Improvement\n3\n5\n2\n2nd\n2\n5th\n+3\n-\n3\n6\n2\n3rd\n3\n6th\n+3\nOtherworldly Patron feature\n3\n7\n2\n3rd\n3\n7th\n+3\n-\n3\n8\n2\n4th\n4\n8th\n+3\nAbility Score Improvement\n3\n9\n2\n4th\n4\n9th\n+4\n-\n3\n10\n2\n5th\n5\n10th\n+4\nOtherworldly Patron feature\n4\n10\n2\n5th\n5\n11th\n+4\nMystic Arcanum (6th level)\n4\n11\n3\n5th\n5\n12th\n+4\nAbility Score Improvement\n4\n11\n3\n5th\n6\n13th\n+5\nMystic Arcanum (7th level)\n4\n12\n3\n5th\n6\n14th\n+5\nOtherworldly Patron feature\n4\n12\n3\n5th\n6\n15th\n+5\nMystic Arcanum (8th level)\n4\n13\n3\n5th\n7\n16th\n+5\nAbility Score Improvement\n4\n13\n3\n5th\n7\n17th\n+6\nMystic Arcanum (9th level)\n4\n14\n4\n5th\n7\n18th\n+6\n-\n4\n14\n4\n5th\n8\n19th\n+6\nAbility Score Improvement\n4\n15\n4\n5th\n8\n20th\n+6\nEldritch Master\n4\n15\n4\n5th\n8\n Otherworldly Patron\n\nAt 1st level, you have struck a bargain with an otherworldly being of your choice, such as the Fiend. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level.\n\n Pact Magic\n\nYour arcane research and the magic bestowed on you by your patron have given you facility with spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the warlock spell list.\n\n**Cantrips**\n\nYou know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table.\n\n**Spell Slots**\n\nThe Warlock table shows how many spell slots you have. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.\n\n    For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell thunderwave, you must spend one of those slots, and you cast it as a 3rd-level spell.\n\n**Spells Known of 1st Level and Higher**\n\nAt 1st level, you know two 1st-level spells of your choice from the warlock spell list.\n\n    You learn a new warlock spell every time you gain a level from 2 through 9, as well as at level 19. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.\n\n    Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots.\n\n**Spellcasting Ability**\n\nCharisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one.\n \n**    Spell save DC =** 8 + Proficiency bonus + Charisma modifier\n**    Spell attack modifier =** Proficiency bonus + Charisma modifier \n**Spellcasting Focus**\n\nYou can use an arcane focus as a spellcasting focus for your warlock spells.\n\n Eldritch Invocations\n\nIn your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.\n\n    At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice.\n\n    Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. A level prerequisite in an invocation refers to warlock level, not character level.\n\n Pact Boon\n\nAt 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice.\n\n Pact of the Chain\n\nYou learn the find familiar spell and can cast it as a ritual. The spell doesn’t count against your number of spells known.\n\nWhen you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: imp, pseudodragon, quasit, or sprite.\n\nAdditionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to make one attack of its own with its reaction.\n\n Pact of the Blade\n\nYou can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it. You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nYour pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.\n\nYou can transform one Magic Weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can’t affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks.\n\n Pact of the Tome\n\nYour patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class’s spell list (the three needn’t be from the same list). While the book is on your person, you can cast those cantrips at will. They don’t count against your number of cantrips known. If they don’t appear on the warlock spell list, they are nonetheless warlock spells for you.\n\nIf you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die.\n\n Ability Score Improvement\n\nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.\n\n Mystic Arcanum\n\nAt 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.\n\n    You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.\n\n    At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic A rcanum when you finish a long rest.\n\n Eldritch Master\n\nAt 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again.\n\n Eldritch Invocations\n\nIf an eldritch invocation has prerequisites, you must meet them to learn it. You can learn the invocation at the same time that you meet its prerequisites. A level prerequisite refers to your level in this class.\n\n Agonizing Blast\n\n**Prerequisite**: eldritch blast cantrip\n\nWhen you cast eldritch blast, add your Charisma modifier to the damage it deals on a hit.\n\n Armor of Shadows\n\nYou can cast mage armor on yourself at will, without expending a spell slot or material components.\n\n Ascendant Step\n\n**Prerequisite**: 9th level\n\nYou can cast levitate on yourself at will, without expending a spell slot or material components.\n\n Beast Speech\n\nYou can cast speak with animals at will, without expending a spell slot.\n\n Beguiling Influence\n\nYou gain proficiency in the Deception and Persuasion skills.\n\n Bewitching Whispers\n\n**Prerequisite**: 7th level\n\nYou can cast compulsion once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Book of Ancient Secrets\n\n**Prerequisite**: Pact of the Tome feature\n\nYou can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class’s spell list (the two needn’t be from the same list). The spells appear in the book and don’t count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can’t cast the spells except as rituals, unless you’ve learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag.\n\nOn your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell’s level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it.\n\n Chains of Carceri\n\n**Prerequisite**: 15th level, Pact of the Chain feature\n\nYou can cast hold monster at will—targeting a celestial, fiend, or elemental—without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again.\n\n Devil’s Sight\n\nYou can see normally in darkness, both magical and nonmagical, to a distance of 120 feet.\n\n Dreadful Word\n\n**Prerequisite**: 7th level\n\nYou can cast confusion once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Eldritch Sight\n\nYou can cast detect magic at will, without expending a spell slot.\n\n Eldritch Spear\n\n**Prerequisite**: eldritch blast cantrip\n\nWhen you cast eldritch blast, its range is 300 feet.\n\n Eyes of the Rune Keeper\n\nYou can read all writing.\n\n Fiendish Vigor\n\nYou can cast false life on yourself at will as a 1st-level spell, without expending a spell slot or material components.\n\n Gaze of Two Minds\n\nYou can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature’s senses, you benefit from any special senses possessed by that creature, and you are blinded and deafened to your own surroundings.\n\n Lifedrinker\n\n**Prerequisite**: 12th level, Pact of the Blade feature\n\nWhen you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum 1).\n\n Mask of Many Faces\n\nYou can cast disguise self at will, without expending a spell slot.\n\n Master of Myriad Forms\n\n**Prerequisite**: 15th level\n\nYou can cast alter self at will, without expending a spell slot.\n\n Minions of Chaos\n\n**Prerequisite**: 9th level\n\nYou can cast conjure elemental once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Mire the Mind\n\n**Prerequisite**: 5th level\n\nYou can cast slow once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Misty Visions\n\nYou can cast silent image at will, without expending a spell slot or material components.\n\n One with Shadows\n\n**Prerequisite**: 5th level\n\nWhen you are in an area of dim light or darkness, you can use your action to become invisible until you move or take an action or a reaction.\n\n Otherworldly Leap\n\n**Prerequisite**: 9th level\n\nYou can cast jump on yourself at will, without expending a spell slot or material components.\n\n Repelling Blast\n\n**Prerequisite**: eldritch blast cantrip\n\nWhen you hit a creature with eldritch blast, you can push the creature up to 10 feet away from you in a straight line.\n\n Sculptor of Flesh\n\n**Prerequisite**: 7th level\n\nYou can cast polymorph once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Sign of Ill Omen\n\n**Prerequisite**: 5th level\n\nYou can cast bestow curse once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Thief of Five Fates\n\nYou can cast bane once using a warlock spell slot. You can’t do so again until you finish a long rest.\n\n Thirsting Blade\n\n**Prerequisite**: 5th level, Pact of the Blade feature\n\nYou can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn.\n\n Visions of Distant Realms\n\n**Prerequisite**: 15th level\n\nYou can cast arcane eye at will, without expending a spell slot.\n\n Voice of the Chain Master\n\n**Prerequisite**: Pact of the Chain feature\n\nYou can communicate telepathically with your familiar and perceive through your familiar’s senses as long as you are on the same plane of existence.\n\nAdditionally, while perceiving through your familiar’s senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech.\n\n Whispers of the Grave\n\n**Prerequisite**: 9th level\n\nYou can cast speak with dead at will, without expending a spell slot.\n\n Witch Sight\n\n**Prerequisite**: 15th level\n\nYou can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight.\n\n Otherworldly Patrons\n\nThe beings that serve as patrons for warlocks are mighty inhabitants of other planes of existence—not gods, but almost godlike in their power. Various patrons give their warlocks access to different powers and invocations, and expect significant favors in return.\n\nSome patrons collect warlocks, doling out mystic knowledge relatively freely or boasting of their ability to bind mortals to their will. Other patrons bestow their power only grudgingly, and might make a pact with only one warlock. Warlocks who serve the same patron might view each other as allies, siblings, or rivals.\n\n The Fiend\n\nYou have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz’Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths.\n\n Expanded Spell List\n\nThe Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.\n\n                                              Table: Fiend Expanded SpellsSpell LevelSpells1stBurning Hands, command2ndBlindness/Deafness, scorching ray3rdfireball, stinking cloud4thFire Shield, wall of fire5thFlame Strike, hallow Dark One’s Blessing\n\nStarting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1).\n\n Dark One’s Own Luck\n\nStarting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll’s effects occur.\n\nOnce you use this feature, you can’t use it again until you finish a short or long rest.\n\n Fiendish Resilience\n\nStarting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance.\n\n Hurl Through Hell\n\nStarting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.\n\nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience.\n\nOnce you use this feature, you can’t use it again until you finish a long rest.\n\n Your Pact Boon\n\nEach Pact Boon option produces a special creature or an object that reflects your patron’s nature.\n\n**Pact of the Chain**. Your familiar is more cunning than a typical familiar. Its default form can be a reflection of your patron, with imps and quasits tied to the Fiend.\n\n**Pact of the Blade**. If you serve the Fiend, your weapon could be an axe made of black metal and adorned with decorative flames.\n\n**Pact of the Tome**. Your Book of Shadows could be a weighty tome bound in demon hide studded with iron, holding spells of conjuration and a wealth of forbidden lore about the sinister regions of the cosmos, a gift of the Fiend.\n\n     ","htmlcontent":"<aside><strong><a href=\"/compendium/dnd5e/Warlock%20Spells%20by%20Name\">Warlock Spells by Name<br></a></strong><strong><a href=\"/compendium/dnd5e/Warlock%20Spells%20by%20Level\">Warlock Spells by Level</a></strong></aside><br>As a warlock, you gain the following class features.<br><br><h2>Hit Points</h2><strong>Hit Dice</strong>: 1d8 per warlock level<br><strong>Hit Points at 1st Level</strong>: 8 + your Constitution modifier<br><strong>Hit Points at Higher Levels</strong>: 1d8 (or 5) + your Constitution modifier per warlock level after 1st<br><br><h2>Starting Proficiencies</h2>You are proficient with the following items, in addition to any proficiencies provided by your race or background.<br><br><strong>Armor:</strong> light armor<br><strong>Weapons:</strong> simple weapons<br><strong>Tools:</strong> none<br><strong>Skills:</strong> Choose two skills from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion<br><br><h2>Starting Equipment</h2>You start with the following items, plus anything provided by your background.<br><br>• (a) a light crossbow and 20 bolts or (b) any simple weapon<br>• (a) a component pouch or (b) an arcane focus<br>• (a) a scholar's pack or (b) a dungeoneer's pack<br>• Leather Armor, any simple weapon, and two daggers<br><br>Alternatively, you may start with 4d4 x 10 gp to buy your own equipment.<br><br><table>\n<caption>Table: The Warlock</caption>\n<thead><tr>\n<th style=\"text-align:center\">Level</th>\n<th style=\"text-align:center\">Proficiency Bonus</th>\n<th style=\"text-align:center\">Features</th>\n<th style=\"text-align:center\">Cantrips Known</th>\n<th style=\"text-align:center\">Spells Known</th>\n<th style=\"text-align:center\">Spell Slots</th>\n<th style=\"text-align:center\">Slot Level</th>\n<th style=\"text-align:center\">Invocations<br>\nKnown</th>\n</tr></thead>\n<tbody>\n<tr>\n<td style=\"text-align:center\">1st</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Otherworldly Patron, Pact Magic</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1st</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">2nd</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Eldritch Invocations</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1st</td>\n<td style=\"text-align:center\">2</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">3rd</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Pact Boon</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">2nd</td>\n<td style=\"text-align:center\">2</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">4th</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">2nd</td>\n<td style=\"text-align:center\">2</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">6</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">3rd</td>\n<td style=\"text-align:center\">3</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">6th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">Otherworldly Patron feature</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">7</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">3rd</td>\n<td style=\"text-align:center\">3</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">7th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">8</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">4th</td>\n<td style=\"text-align:center\">4</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">8th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">9</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">4th</td>\n<td style=\"text-align:center\">4</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">9th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">10</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">5</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">10th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">Otherworldly Patron feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">10</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">5</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">11th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">Mystic Arcanum (6th level)</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">11</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">5</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">12th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">11</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">6</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">13th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Mystic Arcanum (7th level)</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">12</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">6</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">14th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Otherworldly Patron feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">12</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">6</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">15th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Mystic Arcanum (8th level)</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">13</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">7</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">16th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">13</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">7</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">17th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">Mystic Arcanum (9th level)</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">14</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">7</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">18th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">14</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">8</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">19th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">15</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">8</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">20th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">Eldritch Master</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">15</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">8</td>\n</tr>\n</tbody>\n</table><br><br><h2>Otherworldly Patron</h2>At 1st level, you have struck a bargain with an otherworldly being of your choice, such as the Fiend. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level.<br><br><h2>Pact Magic</h2>Your arcane research and the magic bestowed on you by your patron have given you facility with spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the warlock spell list.<br><br><strong>Cantrips</strong><br><br>You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table.<br><br><strong>Spell Slots</strong><br><br>The Warlock table shows how many spell slots you have. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.<br><br>    For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell thunderwave, you must spend one of those slots, and you cast it as a 3rd-level spell.<br><br><strong>Spells Known of 1st Level and Higher</strong><br><br>At 1st level, you know two 1st-level spells of your choice from the warlock spell list.<br><br>    You learn a new warlock spell every time you gain a level from 2 through 9, as well as at level 19. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.<br><br>    Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots.<br><br><strong>Spellcasting Ability</strong><br><br>Charisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one.<br><div style=\"margin-left: 20px;\">\n<br><strong>    Spell save DC =</strong> 8 + Proficiency bonus + Charisma modifier<br><strong>    Spell attack modifier =</strong> Proficiency bonus + Charisma modifier</div><br><strong>Spellcasting Focus</strong><br><br>You can use an arcane focus as a spellcasting focus for your warlock spells.<br><br><h2>Eldritch Invocations</h2>In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.<br><br>    At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice.<br><br>    Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. A level prerequisite in an invocation refers to warlock level, not character level.<br><br><h2>Pact Boon</h2>At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice.<br><br><h3>Pact of the Chain</h3>You learn the <em>find familiar</em> spell and can cast it as a ritual. The spell doesn’t count against your number of spells known.<br><br>When you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: imp, pseudodragon, quasit, or sprite.<br><br>Additionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to make one attack of its own with its reaction.<br><br><h3>Pact of the Blade</h3>You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it. You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.<br><br>Your pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.<br><br>You can transform one Magic Weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can’t affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks.<br><br><h3>Pact of the Tome</h3>Your patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class’s spell list (the three needn’t be from the same list). While the book is on your person, you can cast those cantrips at will. They don’t count against your number of cantrips known. If they don’t appear on the warlock spell list, they are nonetheless warlock spells for you.<br><br>If you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die.<br><br><h2>Ability Score Improvement</h2>When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.<br><br><h2>Mystic Arcanum</h2>At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.<br><br>    You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.<br><br>    At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic A rcanum when you finish a long rest.<br><br><h2>Eldritch Master</h2>At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again.<br><br><h2>Eldritch Invocations</h2>If an eldritch invocation has prerequisites, you must meet them to learn it. You can learn the invocation at the same time that you meet its prerequisites. A level prerequisite refers to your level in this class.<br><br><h3>Agonizing Blast</h3><strong>Prerequisite</strong>: eldritch blast cantrip<br><br>When you cast <em>eldritch blast</em>, add your Charisma modifier to the damage it deals on a hit.<br><br><h3>Armor of Shadows</h3>You can cast <em>mage armor</em> on yourself at will, without expending a spell slot or material components.<br><br><h3>Ascendant Step</h3><strong>Prerequisite</strong>: 9th level<br><br>You can cast <em>levitate</em> on yourself at will, without expending a spell slot or material components.<br><br><h3>Beast Speech</h3>You can cast <em>speak with animals</em> at will, without expending a spell slot.<br><br><h3>Beguiling Influence</h3>You gain proficiency in the Deception and Persuasion skills.<br><br><h3>Bewitching Whispers</h3><strong>Prerequisite</strong>: 7th level<br><br>You can cast <em>compulsion</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Book of Ancient Secrets</h3><strong>Prerequisite</strong>: Pact of the Tome feature<br><br>You can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class’s spell list (the two needn’t be from the same list). The spells appear in the book and don’t count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can’t cast the spells except as rituals, unless you’ve learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag.<br><br>On your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell’s level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it.<br><br><h3>Chains of Carceri</h3><strong>Prerequisite</strong>: 15th level, Pact of the Chain feature<br><br>You can cast <em>hold monster</em> at will—targeting a celestial, fiend, or elemental—without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again.<br><br><h3>Devil’s Sight</h3>You can see normally in darkness, both magical and nonmagical, to a distance of 120 feet.<br><br><h3>Dreadful Word</h3><strong>Prerequisite</strong>: 7th level<br><br>You can cast <em>confusion</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Eldritch Sight</h3>You can cast <em>detect magic</em> at will, without expending a spell slot.<br><br><h3>Eldritch Spear</h3><strong>Prerequisite</strong>: <em>eldritch blast</em> cantrip<br><br>When you cast <em>eldritch blast</em>, its range is 300 feet.<br><br><h3>Eyes of the Rune Keeper</h3>You can read all writing.<br><br><h3>Fiendish Vigor</h3>You can cast <em>false life</em> on yourself at will as a 1st-level spell, without expending a spell slot or material components.<br><br><h3>Gaze of Two Minds</h3>You can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature’s senses, you benefit from any special senses possessed by that creature, and you are blinded and deafened to your own surroundings.<br><br><h3>Lifedrinker</h3><strong>Prerequisite</strong>: 12th level, Pact of the Blade feature<br><br>When you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum 1).<br><br><h3>Mask of Many Faces</h3>You can cast <em>disguise self</em> at will, without expending a spell slot.<br><br><h3>Master of Myriad Forms</h3><strong>Prerequisite</strong>: 15th level<br><br>You can cast <em>alter self</em> at will, without expending a spell slot.<br><br><h3>Minions of Chaos</h3><strong>Prerequisite</strong>: 9th level<br><br>You can cast <em>conjure elemental</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Mire the Mind</h3><strong>Prerequisite</strong>: 5th level<br><br>You can cast <em>slow</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Misty Visions</h3>You can cast <em>silent image</em> at will, without expending a spell slot or material components.<br><br><h3>One with Shadows</h3><strong>Prerequisite</strong>: 5th level<br><br>When you are in an area of dim light or darkness, you can use your action to become invisible until you move or take an action or a reaction.<br><br><h3>Otherworldly Leap</h3><strong>Prerequisite</strong>: 9th level<br><br>You can cast <em>jump</em> on yourself at will, without expending a spell slot or material components.<br><br><h3>Repelling Blast</h3><strong>Prerequisite</strong>: eldritch blast cantrip<br><br>When you hit a creature with <em>eldritch blast</em>, you can push the creature up to 10 feet away from you in a straight line.<br><br><h3>Sculptor of Flesh</h3><strong>Prerequisite</strong>: 7th level<br><br>You can cast <em>polymorph</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Sign of Ill Omen</h3><strong>Prerequisite</strong>: 5th level<br><br>You can cast <em>bestow curse</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Thief of Five Fates</h3>You can cast <em>bane</em> once using a warlock spell slot. You can’t do so again until you finish a long rest.<br><br><h3>Thirsting Blade</h3><strong>Prerequisite</strong>: 5th level, Pact of the Blade feature<br><br>You can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn.<br><br><h3>Visions of Distant Realms</h3><strong>Prerequisite</strong>: 15th level<br><br>You can cast <em>arcane eye</em> at will, without expending a spell slot.<br><br><h3>Voice of the Chain Master</h3><strong>Prerequisite</strong>: Pact of the Chain feature<br><br>You can communicate telepathically with your familiar and perceive through your familiar’s senses as long as you are on the same plane of existence.<br><br>Additionally, while perceiving through your familiar’s senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech.<br><br><h3>Whispers of the Grave</h3><strong>Prerequisite</strong>: 9th level<br><br>You can cast <em>speak with dead</em> at will, without expending a spell slot.<br><br><h3>Witch Sight</h3><strong>Prerequisite</strong>: 15th level<br><br>You can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight.<br><br><h2>Otherworldly Patrons</h2>The beings that serve as patrons for warlocks are mighty inhabitants of other planes of existence—not gods, but almost godlike in their power. Various patrons give their warlocks access to different powers and invocations, and expect significant favors in return.<br><br>Some patrons collect warlocks, doling out mystic knowledge relatively freely or boasting of their ability to bind mortals to their will. Other patrons bestow their power only grudgingly, and might make a pact with only one warlock. Warlocks who serve the same patron might view each other as allies, siblings, or rivals.<br><br><h3>The Fiend</h3>You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz’Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths.<br><br><h4>Expanded Spell List</h4>The Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.<br><br><table>\n<caption>Table: Fiend Expanded Spells</caption>\n<thead><tr>\n<th>Spell Level</th>\n<th>Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>1st</td>\n<td><em>Burning Hands, command</em></td>\n</tr>\n<tr>\n<td>2nd</td>\n<td><em>Blindness/Deafness, scorching ray</em></td>\n</tr>\n<tr>\n<td>3rd</td>\n<td><em>fireball, stinking cloud</em></td>\n</tr>\n<tr>\n<td>4th</td>\n<td><em>Fire Shield, wall of fire</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Flame Strike, hallow</em></td>\n</tr>\n</tbody>\n</table><h4>Dark One’s Blessing</h4>Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1).<br><br><h4>Dark One’s Own Luck</h4>Starting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll’s effects occur.<br><br>Once you use this feature, you can’t use it again until you finish a short or long rest.<br><br><h4>Fiendish Resilience</h4>Starting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance.<br><br><h4>Hurl Through Hell</h4>Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.<br><br>At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience.<br><br>Once you use this feature, you can’t use it again until you finish a long rest.<br><br><h2>Your Pact Boon</h2>Each Pact Boon option produces a special creature or an object that reflects your patron’s nature.<br><br><strong>Pact of the Chain</strong>. Your familiar is more cunning than a typical familiar. Its default form can be a reflection of your patron, with imps and quasits tied to the Fiend.<br><br><strong>Pact of the Blade</strong>. If you serve the Fiend, your weapon could be an axe made of black metal and adorned with decorative flames.<br><br><strong>Pact of the Tome</strong>. Your Book of Shadows could be a weighty tome bound in demon hide studded with iron, holding spells of conjuration and a wealth of forbidden lore about the sinister regions of the cosmos, a gift of the Fiend.<br><br>","data":{"Source":"SRD 5.0","Category":"Classes","Hit Dice":"d8","Saving Throws":"Wisdom, Charisma"}}