{"name":"Druid","id":5200,"content":" **Druid Spells by Name\n****Druid Spells by Level** \nAs a druid, you gain the following class features.\n\n Hit Points\n\n**Hit Dice**: 1d8 per druid level\n**Hit Points at 1st Level**: 8 + your Constitution modifier\n**Hit Points at Higher Levels**: 1d8 (or 5) + your Constitution modifier per druid level after 1st\n\n Starting Proficiencies\n\nYou are proficient with the following items, in addition to any proficiencies provided by your race or background.\n\n**Armor:** light armor, medium armor, shields (druids will not wear armor or use shields made of metal)\n**Weapons:** clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears\n**Tools:** herbalism kit\n**Skills**: Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival\n\n Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n• (a) a wooden shield or (b) any simple weapon\n• (a) a scimitar or (b) any simple melee weapon\n• Leather Armor, an explorer's pack, and a druidic focus\n\nAlternatively, you may start with 2d4 x 10 gp to buy your own equipment.\n\n   Table: The Druid\nLevel\nProficiency Bonus\nFeatures\nCantrips Known\nSpell Slots per Spell Level\n1st\n2nd\n3rd\n4th\n5th\n6th\n7th\n8th\n9th\n1st\n+2\nDruidic, Spellcasting\n2\n2\n-\n-\n-\n-\n-\n-\n-\n-\n2nd\n+2\nWild Shape, Druid Circle\n2\n3\n-\n-\n-\n-\n-\n-\n-\n-\n3rd\n+2\n-\n2\n4\n2\n-\n-\n-\n-\n-\n-\n-\n4th\n+2\nWild Shape improvement, Ability Score Improvement\n3\n4\n3\n-\n-\n-\n-\n-\n-\n-\n5th\n+3\n-\n3\n4\n3\n2\n-\n-\n-\n-\n-\n-\n6th\n+3\nDruid Circle feature\n3\n4\n3\n3\n-\n-\n-\n-\n-\n-\n7th\n+3\n-\n3\n4\n3\n3\n1\n-\n-\n-\n-\n-\n8th\n+3\nWild Shape improvement, Ability Score Improvement\n3\n4\n3\n3\n2\n-\n-\n-\n-\n-\n9th\n+4\n-\n3\n4\n3\n3\n3\n1\n-\n-\n-\n-\n10th\n+4\nDruid Circle feature\n4\n4\n3\n3\n3\n2\n-\n-\n-\n-\n11th\n+4\n-\n4\n4\n3\n3\n3\n2\n1\n-\n-\n-\n12th\n+4\nAbility Score Improvement\n4\n4\n3\n3\n3\n2\n1\n-\n-\n-\n13th\n+5\n-\n4\n4\n3\n3\n3\n2\n1\n1\n-\n-\n14th\n+5\nDruid Circle feature\n4\n4\n3\n3\n3\n2\n1\n1\n-\n-\n15th\n+5\n-\n4\n4\n3\n3\n3\n2\n1\n1\n1\n-\n16th\n+5\nAbility Score Improvement\n4\n4\n3\n3\n3\n2\n1\n1\n1\n-\n17th\n+6\n-\n4\n4\n3\n3\n3\n2\n1\n1\n1\n1\n18th\n+6\nTimeless Body, Beast Spells\n4\n4\n3\n3\n3\n3\n1\n1\n1\n1\n19th\n+6\nAbility Score Improvement\n4\n4\n3\n3\n3\n3\n2\n1\n1\n1\n20th\n+6\nArchdruid\n4\n4\n3\n3\n3\n3\n2\n2\n1\n1 Druidic\n\nYou know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic.\n\n Spellcasting\n\nDrawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See chapter 10 for the general rules of spellcasting and chapter 11 for the druid spell list.\n\n**Cantrips\n**\nAt 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.\n\n**Preparing and Casting Spells**\n\nThe Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\n    You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\n    For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level ar 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\n    You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\n**Spellcasting Ability**\n\nWisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.\n\n **Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier\n**    Spell attack modifier** = your proficiency bonus + your Wisdom modifier \n**Ritual Casting**\n\nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\n**Spellcasting Focus**\n\nYou can use a druidic focus (see \"Equipment\") as a spellcasting focus for your druid spells.\n\n Wild Shape\n\nStarting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\n    Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\n\n   Table: Beast ShapesLevelMax. CRLimitationsExample2nd1/4No flying or swimming speedWolf4th1/2No flying speedCrocodile8th1—Giant eagle    You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\n    While you are transformed, the following rules apply:\n\n • Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n• When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n• You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.\n• You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\n• You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.  Druid Circle\n\nAt 2nd level, you choose to identify with a circle of druids, such as the Circle of the Land. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.\n\n Ability Score Improvement\n\nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.\n\n Timeless Body\n\nStarting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.\n\n Beast Spells\n\nBeginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components.\n\n Archdruid\n\nAt 20th level, you can use your Wild Shape an unlimited number of times.\n\n    Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.\n\n Circle of the Land\n\nThe Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle’s wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle’s mysterious rites.\n\n Bonus Cantrip\n\nWhen you choose this circle at 2nd level, you learn one additional druid cantrip of your choice.\n\n Natural Recovery\n\nStarting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can’t use this feature again until you finish a long rest.\n\nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots.\n\n Circle Spells\n\nYour mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid.\n\nChoose that land—arctic, coast, desert, forest, grassland, mountain, or swamp—and consult the associated list of spells.\n\nOnce you gain access to a circle spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. If you gain access to a spell that doesn’t appear on the druid spell list, the spell is nonetheless a druid spell for you.\n\n         Table: ArcticDruid LevelCircle Spells3rdHold Person, Spike Growth5thSleet Storm, Slow7thFreedom of Movement, Ice Storm9thCommune with Nature, Cone of ColdTable: CoastDruid LevelCircle Spells3rdMirror Image, Misty Step5thWater Breathing, Water Walk7thControl Water, Freedom of Movement9thConjure Elemental, ScryingTable: DesertDruid LevelCircle Spells3rdBlur, Silence5thCreate Food and Water, Protection from Energy7thBlight, Hallucinatory Terrain9thInsect Plague, Wall of StoneTable: ForestDruid LevelCircle Spells3rdBarkskin, Spider Climb5thCall Lightning, Plant Growth7thDivination, Freedom of Movement9thCommune with Nature, Tree StrideTable: GrasslandDruid LevelCircle Spells3rdInvisibility, Pass Without Trace5thDaylight, Haste7thDivination, Freedom of Movement9thDream, Insect PlagueTable: MountainDruid LevelCircle Spells3rdSpider Climb, Spike Growth5thLightning Bolt, Meld into Stone7thStone Shape, Stoneskin9thPasswall, Wall of StoneTable: SwampDruid LevelCircle Spells3rdAcid Arrow, Darkness5thWater Walk, Stinking Cloud7thFreedom of Movement, Locate Creature9thInsect Plague, Scrying Land’s Stride\n\nStarting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell.\n\n Nature’s Ward\n\nWhen you reach 10th level, you can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease.\n\n Nature’s Sanctuary\n\nWhen you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.\n\nThe creature is aware of this effect before it makes its attack against you.\n\n Sacred Plants and Wood\n\nA druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe.\n\nSimilarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins.\n\nDruids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants.\n\n Druids and the Gods\n\nSome druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse (the lists of gods in Pantheons include many such deities). The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples.\n\n     ","htmlcontent":"<aside><strong><a href=\"/compendium/dnd5e/Druid%20Spells%20by%20Name\">Druid Spells by Name<br></a></strong><strong><a href=\"/compendium/dnd5e/Druid%20Spells%20by%20Level\">Druid Spells by Level</a></strong></aside><br>As a druid, you gain the following class features.<br><br><h2>Hit Points</h2><strong>Hit Dice</strong>: 1d8 per druid level<br><strong>Hit Points at 1st Level</strong>: 8 + your Constitution modifier<br><strong>Hit Points at Higher Levels</strong>: 1d8 (or 5) + your Constitution modifier per druid level after 1st<br><br><h2>Starting Proficiencies</h2>You are proficient with the following items, in addition to any proficiencies provided by your race or background.<br><br><strong>Armor:</strong> light armor, medium armor, shields (druids will not wear armor or use shields made of metal)<br><strong>Weapons:</strong> clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears<br><strong>Tools:</strong> herbalism kit<br><strong>Skills</strong>: Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival<br><br><h2>Starting Equipment</h2>You start with the following items, plus anything provided by your background.<br><br>• (a) a wooden shield or (b) any simple weapon<br>• (a) a scimitar or (b) any simple melee weapon<br>• Leather Armor, an explorer's pack, and a druidic focus<br><br>Alternatively, you may start with 2d4 x 10 gp to buy your own equipment.<br><br><table>\n<caption>Table: The Druid</caption>\n<thead>\n<tr>\n<th rowspan=\"2\" style=\"text-align:center\">Level</th>\n<th rowspan=\"2\" style=\"text-align:center\">Proficiency Bonus</th>\n<th rowspan=\"2\" style=\"text-align:center\">Features</th>\n<th rowspan=\"2\" style=\"text-align:center\">Cantrips Known</th>\n<th colspan=\"9\" style=\"text-align:center\">Spell Slots per Spell Level</th>\n</tr>\n<tr>\n<th style=\"text-align:center\">1st</th>\n<th style=\"text-align:center\">2nd</th>\n<th style=\"text-align:center\">3rd</th>\n<th style=\"text-align:center\">4th</th>\n<th style=\"text-align:center\">5th</th>\n<th style=\"text-align:center\">6th</th>\n<th style=\"text-align:center\">7th</th>\n<th style=\"text-align:center\">8th</th>\n<th style=\"text-align:center\">9th</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center\">1st</td>\n<td style=\"text-align:center\">+2</td>\n<td>Druidic, Spellcasting</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">2nd</td>\n<td style=\"text-align:center\">+2</td>\n<td>Wild Shape, Druid Circle</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">3rd</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">4th</td>\n<td style=\"text-align:center\">+2</td>\n<td>Wild Shape improvement, Ability Score Improvement</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">6th</td>\n<td style=\"text-align:center\">+3</td>\n<td>Druid Circle feature</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">7th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">8th</td>\n<td style=\"text-align:center\">+3</td>\n<td>Wild Shape improvement, Ability Score Improvement</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">9th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">10th</td>\n<td style=\"text-align:center\">+4</td>\n<td>Druid Circle feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">11th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">12th</td>\n<td style=\"text-align:center\">+4</td>\n<td>Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">13th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">14th</td>\n<td style=\"text-align:center\">+5</td>\n<td>Druid Circle feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">15th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">16th</td>\n<td style=\"text-align:center\">+5</td>\n<td>Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">17th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">18th</td>\n<td style=\"text-align:center\">+6</td>\n<td>Timeless Body, Beast Spells</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">19th</td>\n<td style=\"text-align:center\">+6</td>\n<td>Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">20th</td>\n<td style=\"text-align:center\">+6</td>\n<td>Archdruid</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">1</td>\n</tr>\n</tbody>\n</table><h2>Druidic</h2>You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic.<br><br><h2>Spellcasting</h2>Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See chapter 10 for the general rules of spellcasting and chapter 11 for the druid spell list.<br><br><strong>Cantrips<br></strong><br>At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.<br><br><strong>Preparing and Casting Spells</strong><br><br>The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.<br><br>    You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.<br><br>    For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level ar 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.<br><br>    You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.<br><br><strong>Spellcasting Ability</strong><br><br>Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.<br><br><div style=\"margin-left: 20px;\">\n<strong>Spell save DC</strong> = 8 + your proficiency bonus + your Wisdom modifier<br><strong>    Spell attack modifier</strong> = your proficiency bonus + your Wisdom modifier</div><br><strong>Ritual Casting</strong><br><br>You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.<br><br><strong>Spellcasting Focus</strong><br><br>You can use a druidic focus (see \"Equipment\") as a spellcasting focus for your druid spells.<br><br><h2>Wild Shape</h2>Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.<br><br>    Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.<br><br><table>\n<caption>Table: Beast Shapes</caption>\n<thead><tr>\n<th>Level</th>\n<th>Max. CR</th>\n<th>Limitations</th>\n<th>Example</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>2nd</td>\n<td>1/4</td>\n<td>No flying or swimming speed</td>\n<td>Wolf</td>\n</tr>\n<tr>\n<td>4th</td>\n<td>1/2</td>\n<td>No flying speed</td>\n<td>Crocodile</td>\n</tr>\n<tr>\n<td>8th</td>\n<td>1</td>\n<td>—</td>\n<td>Giant eagle</td>\n</tr>\n</tbody>\n</table>    You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.<br><br>    While you are transformed, the following rules apply:<br><br><ul>\n<li>Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.</li>\n<li>When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.</li>\n<li>You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.</li>\n<li>You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.</li>\n<li>You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.</li>\n</ul><br><h2>Druid Circle</h2>At 2nd level, you choose to identify with a circle of druids, such as the Circle of the Land. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.<br><br><h2>Ability Score Improvement</h2>When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.<br><br><h2>Timeless Body</h2>Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.<br><br><h2>Beast Spells</h2>Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components.<br><br><h2>Archdruid</h2>At 20th level, you can use your Wild Shape an unlimited number of times.<br><br>    Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.<br><br><h2>Circle of the Land</h2>The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle’s wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle’s mysterious rites.<br><br><h3>Bonus Cantrip</h3>When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice.<br><br><h3>Natural Recovery</h3>Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can’t use this feature again until you finish a long rest.<br><br>For example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots.<br><br><h3>Circle Spells</h3>Your mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid.<br><br>Choose that land—<em>arctic</em>, <em>coast</em>, <em>desert</em>, <em>forest</em>, <em>grassland</em>, <em>mountain</em>, or <em>swamp</em>—and consult the associated list of spells.<br><br>Once you gain access to a circle spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. If you gain access to a spell that doesn’t appear on the druid spell list, the spell is nonetheless a druid spell for you.<br><br><table>\n<caption>Table: Arctic</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td>\n<em>Hold Person</em>, S<em>pike Growth</em>\n</td>\n</tr>\n<tr>\n<td>5th</td>\n<td>\n<em>Sleet Storm</em>, S<em>low</em>\n</td>\n</tr>\n<tr>\n<td>7th</td>\n<td>\n<em>Freedom of Movement</em>, <em>I</em><em>ce Storm</em>\n</td>\n</tr>\n<tr>\n<td>9th</td>\n<td>\n<em>Commune with Nature</em>, <em>C</em><em>one of Cold</em>\n</td>\n</tr>\n</tbody>\n</table><table>\n<caption>Table: Coast</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Mirror Image, Misty Step</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Water Breathing, Water Walk</em></td>\n</tr>\n<tr>\n<td>7th</td>\n<td><em>Control Water, Freedom of Movement</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Conjure Elemental, Scrying</em></td>\n</tr>\n</tbody>\n</table><table>\n<caption>Table: Desert</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Blur, Silence</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Create Food and Water, Protection from Energy</em></td>\n</tr>\n<tr>\n<td>7th</td>\n<td><em>Blight, Hallucinatory Terrain</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Insect Plague, Wall of Stone</em></td>\n</tr>\n</tbody>\n</table><table>\n<caption>Table: Forest</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Barkskin, Spider Climb</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Call Lightning, Plant Growth</em></td>\n</tr>\n<tr>\n<td>7th</td>\n<td><em>Divination, Freedom of Movement</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Commune with Nature, Tree Stride</em></td>\n</tr>\n</tbody>\n</table><table>\n<caption>Table: Grassland</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Invisibility, Pass Without Trace</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Daylight, Haste</em></td>\n</tr>\n<tr>\n<td>7th</td>\n<td><em>Divination, Freedom of Movement</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Dream, Insect Plague</em></td>\n</tr>\n</tbody>\n</table><table>\n<caption>Table: Mountain</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Spider Climb, Spike Growth</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Lightning Bolt, Meld into Stone</em></td>\n</tr>\n<tr>\n<td>7th</td>\n<td><em>Stone Shape, Stoneskin</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Passwall, Wall of Stone</em></td>\n</tr>\n</tbody>\n</table><table>\n<caption>Table: Swamp</caption>\n<thead><tr>\n<th>Druid Level</th>\n<th>Circle Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Acid Arrow, Darkness</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Water Walk, Stinking Cloud</em></td>\n</tr>\n<tr>\n<td>7th</td>\n<td><em>Freedom of Movement, Locate Creature</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Insect Plague, Scrying</em></td>\n</tr>\n</tbody>\n</table><h3>Land’s Stride</h3>Starting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.<br><br>In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the <em>entangle</em> spell.<br><br><h3>Nature’s Ward</h3>When you reach 10th level, you can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease.<br><br><h3>Nature’s Sanctuary</h3>When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.<br><br>The creature is aware of this effect before it makes its attack against you.<br><br><h2>Sacred Plants and Wood</h2>A druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe.<br><br>Similarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins.<br><br>Druids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants.<br><br><h2>Druids and the Gods</h2>Some druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse (the lists of gods in Pantheons include many such deities). The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples.<br><br>","data":{"Source":"SRD 5.0","Category":"Classes","Hit Dice":"d8","Saving Throws":"Intelligence, Wisdom"}}