{"name":"Paladin","id":5204,"content":" **Paladin Spells by Name\nPaladin Spells by Level** \nAs a paladin, you gain the following class features.\n\n Hit Points\n\n**Hit Dice**: 1d10 per paladin level\n**Hit Points at 1st Level**: 10 + your Constitution modifier\n**Hit Points at Higher Levels**: 1d10 (or 6) + your Constitution modifier per paladin level after 1st\n\n Starting Proficiencies\n\nYou are proficient with the following items, in addition to any proficiencies provided by your race or background.\n\n**Armor**: light armor, medium armor, heavy armor, shields\n**Weapons**: simple weapons, martial weapons\n**Tools**: none\n**Skills**: Choose two from Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion\n\n Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n• (a) a martial weapon and a shield or (b) two martial weapons\n• (a) five javelins or (b) any simple melee weapon\n• (a) a priest's pack or (b) an explorer's pack\n• Chain Mail and a holy symbol\n\nAlternatively, you may start with 5d4 x 10 gp to buy your own equipment.\n\n\n   Table: The Paladin\nLevel\nProficiency Bonus\n\nFeatures\nSpell Slots per Spell Level\n1st\n2nd\n3rd\n4th\n5th\n1st\n+2\nDivine Sense, Lay on Hands\n-\n-\n-\n-\n-\n2nd\n+2\nFighting Style, Spellcasting, Divine Smite\n2\n-\n-\n-\n-\n3rd\n+2\nDivine Health, Sacred Oath\n3\n-\n-\n-\n-\n4th\n+2\nAbility Score Improvement\n3\n-\n-\n-\n-\n5th\n+3\nExtra Attack\n4\n2\n-\n-\n-\n6th\n+3\nAura of Protection\n4\n2\n-\n-\n-\n7th\n+3\nSacred Oath feature\n4\n3\n-\n-\n-\n8th\n+3\nAbility Score Improvement\n4\n3\n-\n-\n-\n9th\n+4\n-\n4\n3\n2\n-\n-\n10th\n+4\nAura of Courage\n4\n3\n2\n-\n-\n11th\n+4\nImproved Divine Smite\n4\n3\n3\n-\n-\n12th\n+4\nAbility Score Improvement\n4\n3\n3\n-\n-\n13th\n+5\n-\n4\n3\n3\n1\n-\n14th\n+5\nCleansing Touch\n4\n3\n3\n1\n-\n15th\n+5\nSacred Oath feature\n4\n3\n3\n2\n-\n16th\n+5\nAbility Score Improvement\n4\n3\n3\n2\n-\n17th\n+6\n-\n4\n3\n3\n3\n1\n18th\n+6\nAura improvements\n4\n3\n3\n3\n1\n19th\n+6\nAbility Score Improvement\n4\n3\n3\n3\n2\n20th\n+6\nSacred Oath feature\n4\n3\n3\n3\n2\n Divine Sense\n\nThe presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell.\n\n    You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses.\n\n Lay on Hands\n\nYour blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5.\n\n    As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.\n\n    Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.\n\nThis feature has no effect on undead and constructs.\n\n Fighting Style\n\nAt 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.\n\n Defense\n\nWhile you are wearing armor, you gain a +1 bonus to AC.\n\n Dueling\n\nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n\n Great Weapon Fighting\n\nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit.\n\n Protection\n\nWhen a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.\n\n Divine Smite\n\nStarting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend.\n\n Spellcasting\n\nBy 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See chapter 10 for the general rules of spellcasting and chapter 11 for the paladin spell list.\n**\nPreparing and Casting Spells**\n\nThe Paladin table shows how many spell slots you have to cast your spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\n    You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.\n\n    For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\n    You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\n**Spellcasting Ability**\n\nCharisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.\n\n **Spell save DC **= 8 + your proficiency bonus + your Charisma modifier\n**    Spell attack modifier **= your proficiency bonus + your Charisma modifier \n**Spellcasting Focus**\n\nYou can use a holy symbol as a spellcasting focus for your paladin spells.\n\n Divine Health\n\nBy 3rd level, the divine magic flowing through you makes you immune to disease.\n\n Sacred Oath\n\nWhen you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose an oath, such as the Oath of Devotion.\n\nYour choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.\n\n Oath Spells\n\nEach oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don’t count against the number of spells you can prepare each day.\nIf you gain an oath spell that doesn’t appear on the paladin spell list, the spell is nonetheless a paladin spell for you.\n\n Channel Divinity\n\nYour oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.\n\nWhen you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC.\n\n Ability Score Improvement\n\nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.\n\n Extra Attack\n\nBeginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.\n\n Aura of Protection\n\nStarting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.\n\n    At 18th level, the range of this aura increases to 30 feet.\n\n Aura of Courage\n\nStarting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious.\n\n    At 18th level, the range of this aura increases to 30 feet.\n\n Improved Divine Smite\n\nBy 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite.\n\n Cleansing Touch\n\nBeginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.\n\n    You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest.\n\n Sacred Oaths\n\nBecoming a paladin involves taking vows that commit the paladin to the cause of righteousness, an active path of fighting wickedness. The final oath, taken when he or she reaches 3rd level, is the culmination of all the paladin’s training. Some characters with this class don’t consider themselves true paladins until they have reached 3rd level and made this oath. For others, the actual swearing of the oath is a formality, an official stamp on what has always been true in the paladin’s heart.\n\n Oath of Devotion\n\nThe Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards.\n\nMany who swear this oath are devoted to gods of law and good and use their gods’ tenets as the measure of their devotion. They hold angels—the perfect servants of good—as their ideals, and incorporate images of angelic wings into their helmets or coats of arms.\n\n Tenets of Devotion\n\nThough the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets.\n\n • **Honesty**: Don’t lie or cheat. Let your word be your promise.\n• **Courage**: Never fear to act, though caution is wise.\n• **Compassion**: Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom.\n• **Honor**: Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm.\n• **Duty**: Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you.  Oath Spells\n\nYou gain oath spells at the paladin levels listed.\n\n                       Table: Oath of Devotion SpellsLevelSpells3rdProtection from Evil and Good, sanctuary5thLesser Restoration, zone of truth9thBeacon of Hope, dispel magic13thFreedom of Movement, guardian of faith17thcommune, flame strike Channel Divinity\n\nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options.\n\n**Sacred Weapon**: As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.\n\nYou can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.\n\n**Turn the Unholy.** As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.\n\n Aura of Devotion\n\nStarting at 7th level, you and friendly creatures within 10 feet of you can’t be charmed while you are conscious.\n\nAt 18th level, the range of this aura increases to 30 feet.\n\n Purity of Spirit\n\nBeginning at 15th level, you are always under the effects of a protection from evil and good spell.\n\n Holy Nimbus\n\nAt 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.\n\nWhenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.\n\nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.\n\n Breaking Your Oath\n\nA paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath.\n\nA paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all-­ night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-­denial. After a rite of confession and forgiveness, the paladin starts fresh.\n\nIf a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the GM’s discretion, an impenitent paladin might be forced to abandon this class and adopt another.\n\nOnce you use this feature, you can’t use it again until you finish a long rest.\n\n     ","htmlcontent":"<aside><strong><a href=\"/compendium/dnd5e/Paladin%20Spells%20by%20Name\">Paladin Spells by Name<br></a><a href=\"/compendium/dnd5e/Paladin%20Spells%20by%20Level\">Paladin Spells by Level</a></strong></aside><br>As a paladin, you gain the following class features.<br><br><h2>Hit Points</h2><strong>Hit Dice</strong>: 1d10 per paladin level<br><strong>Hit Points at 1st Level</strong>: 10 + your Constitution modifier<br><strong>Hit Points at Higher Levels</strong>: 1d10 (or 6) + your Constitution modifier per paladin level after 1st<br><br><h2>Starting Proficiencies</h2>You are proficient with the following items, in addition to any proficiencies provided by your race or background.<br><br><strong>Armor</strong>: light armor, medium armor, heavy armor, shields<br><strong>Weapons</strong>: simple weapons, martial weapons<br><strong>Tools</strong>: none<br><strong>Skills</strong>: Choose two from Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion<br><br><h2>Starting Equipment</h2>You start with the following items, plus anything provided by your background.<br><br>• (a) a martial weapon and a shield or (b) two martial weapons<br>• (a) five javelins or (b) any simple melee weapon<br>• (a) a priest's pack or (b) an explorer's pack<br>• Chain Mail and a holy symbol<br><br>Alternatively, you may start with 5d4 x 10 gp to buy your own equipment.<br><br><br><table>\n<caption>Table: The Paladin</caption>\n<thead>\n<tr>\n<th rowspan=\"2\" style=\"text-align:center\">Level</th>\n<th rowspan=\"2\" style=\"text-align:center\">Proficiency Bonus\n</th>\n<th rowspan=\"2\" style=\"text-align:center\">Features</th>\n<th colspan=\"5\" style=\"text-align:center\">Spell Slots per Spell Level</th>\n</tr>\n<tr>\n<th style=\"text-align:center\">1st</th>\n<th style=\"text-align:center\">2nd</th>\n<th style=\"text-align:center\">3rd</th>\n<th style=\"text-align:center\">4th</th>\n<th style=\"text-align:center\">5th</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center\">1st</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Divine Sense, Lay on Hands</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">2nd</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Fighting Style, Spellcasting, Divine Smite</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">3rd</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Divine Health, Sacred Oath</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">4th</td>\n<td style=\"text-align:center\">+2</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">5th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">Extra Attack</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">6th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">Aura of Protection</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">7th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">Sacred Oath feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">8th</td>\n<td style=\"text-align:center\">+3</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">9th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">10th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">Aura of Courage</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">11th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">Improved Divine Smite</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">12th</td>\n<td style=\"text-align:center\">+4</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">-</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">13th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">14th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Cleansing Touch</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">15th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Sacred Oath feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">16th</td>\n<td style=\"text-align:center\">+5</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n<td style=\"text-align:center\">-</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">17th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">-</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">18th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">Aura improvements</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">1</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">19th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">Ability Score Improvement</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">20th</td>\n<td style=\"text-align:center\">+6</td>\n<td style=\"text-align:left\">Sacred Oath feature</td>\n<td style=\"text-align:center\">4</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">3</td>\n<td style=\"text-align:center\">2</td>\n</tr>\n</tbody>\n</table><br><h2>Divine Sense</h2>The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the <em>hallow</em> spell.<br><br>    You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses.<br><br><h2>Lay on Hands</h2>Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5.<br><br>    As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.<br><br>    Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.<br><br>This feature has no effect on undead and constructs.<br><br><h2>Fighting Style</h2>At 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.<br><br><h3>Defense</h3>While you are wearing armor, you gain a +1 bonus to AC.<br><br><h3>Dueling</h3>When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.<br><br><h3>Great Weapon Fighting</h3>When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit.<br><br><h3>Protection</h3>When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.<br><br><h2>Divine Smite</h2>Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend.<br><br><h2>Spellcasting</h2>By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See chapter 10 for the general rules of spellcasting and chapter 11 for the paladin spell list.<br><strong><br>Preparing and Casting Spells</strong><br><br>The Paladin table shows how many spell slots you have to cast your spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.<br><br>    You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.<br><br>    For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.<br><br>    You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.<br><br><strong>Spellcasting Ability</strong><br><br>Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.<br><br><div style=\"margin-left: 20px;\">\n<strong>Spell save DC </strong>= 8 + your proficiency bonus + your Charisma modifier<br><strong>    Spell attack modifier </strong>= your proficiency bonus + your Charisma modifier</div><br><strong>Spellcasting Focus</strong><br><br>You can use a holy symbol as a spellcasting focus for your paladin spells.<br><br><h2>Divine Health</h2>By 3rd level, the divine magic flowing through you makes you immune to disease.<br><br><h2>Sacred Oath</h2>When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose an oath, such as the Oath of Devotion.<br><br>Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.<br><br><h3>Oath Spells</h3>Each oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don’t count against the number of spells you can prepare each day.<br>If you gain an oath spell that doesn’t appear on the paladin spell list, the spell is nonetheless a paladin spell for you.<br><br><h3>Channel Divinity</h3>Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.<br><br>When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.<br><br>Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC.<br><br><h2>Ability Score Improvement</h2>When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.<br><br><h2>Extra Attack</h2>Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.<br><br><h2>Aura of Protection</h2>Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.<br><br>    At 18th level, the range of this aura increases to 30 feet.<br><br><h2>Aura of Courage</h2>Starting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious.<br><br>    At 18th level, the range of this aura increases to 30 feet.<br><br><h2>Improved Divine Smite</h2>By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite.<br><br><h2>Cleansing Touch</h2>Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.<br><br>    You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest.<br><br><h2>Sacred Oaths</h2>Becoming a paladin involves taking vows that commit the paladin to the cause of righteousness, an active path of fighting wickedness. The final oath, taken when he or she reaches 3rd level, is the culmination of all the paladin’s training. Some characters with this class don’t consider themselves true paladins until they have reached 3rd level and made this oath. For others, the actual swearing of the oath is a formality, an official stamp on what has always been true in the paladin’s heart.<br><br><h3>Oath of Devotion</h3>The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards.<br><br>Many who swear this oath are devoted to gods of law and good and use their gods’ tenets as the measure of their devotion. They hold angels—the perfect servants of good—as their ideals, and incorporate images of angelic wings into their helmets or coats of arms.<br><br><h4>Tenets of Devotion</h4>Though the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets.<br><br><ul>\n<li>\n<strong>Honesty</strong>: Don’t lie or cheat. Let your word be your promise.</li>\n<li>\n<strong>Courage</strong>: Never fear to act, though caution is wise.</li>\n<li>\n<strong>Compassion</strong>: Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom.</li>\n<li>\n<strong>Honor</strong>: Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm.</li>\n<li>\n<strong>Duty</strong>: Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you.</li>\n</ul><br><h4>Oath Spells</h4>You gain oath spells at the paladin levels listed.<br><br><table>\n<caption>Table: Oath of Devotion Spells</caption>\n<thead><tr>\n<th>Level</th>\n<th>Spells</th>\n</tr></thead>\n<tbody>\n<tr>\n<td>3rd</td>\n<td><em>Protection from Evil and Good, sanctuary</em></td>\n</tr>\n<tr>\n<td>5th</td>\n<td><em>Lesser Restoration, zone of truth</em></td>\n</tr>\n<tr>\n<td>9th</td>\n<td><em>Beacon of Hope, dispel magic</em></td>\n</tr>\n<tr>\n<td>13th</td>\n<td><em>Freedom of Movement, guardian of faith</em></td>\n</tr>\n<tr>\n<td>17th</td>\n<td><em>commune, flame strike</em></td>\n</tr>\n</tbody>\n</table><h4>Channel Divinity</h4>When you take this oath at 3rd level, you gain the following two Channel Divinity options.<br><br><strong>Sacred Weapon</strong>: As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.<br><br>You can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.<br><br><strong>Turn the Unholy.</strong> As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.<br><br>A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.<br><br><h4>Aura of Devotion</h4>Starting at 7th level, you and friendly creatures within 10 feet of you can’t be charmed while you are conscious.<br><br>At 18th level, the range of this aura increases to 30 feet.<br><br><h4>Purity of Spirit</h4>Beginning at 15th level, you are always under the effects of a <em>protection from evil and good</em> spell.<br><br><h4>Holy Nimbus</h4>At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.<br><br>Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.<br><br>In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.<br><br><h2>Breaking Your Oath</h2>A paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath.<br><br>A paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all-­ night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-­denial. After a rite of confession and forgiveness, the paladin starts fresh.<br><br>If a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the GM’s discretion, an impenitent paladin might be forced to abandon this class and adopt another.<br><br>Once you use this feature, you can’t use it again until you finish a long rest.<br><br>","data":{"Source":"SRD 5.0","Category":"Classes","Hit Dice":"d10","Saving Throws":"Wisdom, Charisma"}}